/*
 * 절차적 언어 -------------> 구조적 언어
 *  => main안에서 전체 코딩    => 기능별로 나눠서 작업(메소드)
 * 객체지향 프로그래밍 => 매개변수가 거의 없다, 공통으로 사용하는 변수 => 멤버변수
 * 1) 변수의 종류
 * 		1. 인스턴스 변수
 * 		2. 공통(공유) 변수
 * 		3. 지역 변수
 * 2) 캡슐화(데이터보호)
 * 3) 메모리 저장 : 생성자
 * 4) 기능 : 메소드 => 변경가능(오버라이딩)
 * 전체를 재사용할 수 있음 => 상속/포함
 * 클래스 많이 생성 => 한개의 이름으로 제어 => 인터페이스
 * 예외 처리
 * 라이브러리 등
 * -----------------------------------
 * 디자인패턴(MVC 등), 알고리즘
 * ㄴ29개 중 8개(Spring에서 사용)
 * Spring(자체개발)
 * 
 * => 변수 / 데이터형 / 연산자 / 제어문 / 배열 / 메소드 정리 
 * 
 * 
 */
public class 정리_03_17 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
